FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_Serial.c
/*-------------------------------------------------------------------------*
 * File:  LPC1756_Serial.c
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
 /**
 *    @addtogroup LPC1756_Serial
 *  @{
 *  @brief     uEZ LPC1756 Serial Interface
 *  @see http://www.teamfdi.com/uez/
 *  @see http://www.teamfdi.com/uez/files/uEZLicense.txt
 *
 *    LPC23xx/17xx 16550(?) Style serial ports
 * Implementation:
 *      Four serial ports are available (although they can be individually
 *      setup as needed).  Buffers/Queues are not stored here but handled
 *      by the layer above.  Only callback functions from within
 *      the IRQ are provided.
 *
 * @par Example code:
 * Example task to 
 * @par
 * @code
 * #include <uEZ.h>
 * TODO
 * @endcode
 */
#include <Config.h>
#include <uEZTypes.h>
#include <HAL/HAL.h>
#include <HAL/Interrupt.h>
#include <uEZProcessor.h>
#include <uEZPlatformAPI.h>
// TBD:  not here!
#include <uEZRTOS.h>
#include <Source/Processor/NXP/LPC1756/LPC1756_Serial.h>

/*---------------------------------------------------------------------------*
 * Constants and Macros:
 *---------------------------------------------------------------------------*/
#define BAUD_DIVIDER(b)         ((PROCESSOR_OSCILLATOR_FREQUENCY/1)/((b)*16))

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
/** Entry of serial port settings */
typedef struct {
    TUInt32 iInterruptChannel;
    T_irqPriority iPriority;
    UART1_TypeDef *iUART;
    TISRFPtr iISR;
} T_Serial_LPC1756_SerialInfo;

typedef struct {
    const HAL_Serial *iHAL;
    const T_Serial_LPC1756_SerialInfo *iInfo;
    HAL_Serial_Callback_Transmit_Empty iTransmitEmptyFunc;
    HAL_Serial_Callback_Received_Byte iReceivedByteFunc;
    void *iCallbackWorkspace;
    T_Serial_Settings iSettings;
} T_Serial_LPC1756_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
//#define ISerialGrab(entry)         InterruptDisable(entry->iInterruptChannel);
//#define ISerialRelease(entry)      InterruptEnable(entry->iInterruptChannel);
IRQ_ROUTINE(ISerialUART0);
IRQ_ROUTINE(ISerialUART1);
IRQ_ROUTINE(ISerialUART2);
IRQ_ROUTINE(ISerialUART3);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_Serial G_LPC1756_Serial_UART0;
extern const HAL_Serial G_LPC1756_Serial_UART1;
extern const HAL_Serial G_LPC1756_Serial_UART2;
extern const HAL_Serial G_LPC1756_Serial_UART3;

extern const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART0;
extern const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART1;
extern const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART2;
extern const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART3;

T_Serial_LPC1756_Workspace *G_UART0Workspace=0;
T_Serial_LPC1756_Workspace *G_UART1Workspace=0;
T_Serial_LPC1756_Workspace *G_UART2Workspace=0;
T_Serial_LPC1756_Workspace *G_UART3Workspace=0;

/*---------------------------------------------------------------------------*
 * Routine:  ISerialProcessInterrupt
 *---------------------------------------------------------------------------*/
/**
 *  Generic routine for handling any of the serial ports (as passed
 *      into the routine.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 *
 *  @param [in]    *p  			Port's definition to process interrupt
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void ISerialProcessInterrupt(T_Serial_LPC1756_Workspace *p)
{
    TUInt8 iir;

    // Process states until completely done (no more interrupts)
    while (((iir = p->iInfo->iUART->u3.IIR) & 0x01) == 0) {
        // Process that state or return
        switch ((iir>>1) & 7)
        {
            case 0x1:
                // Just ran out of bytes, please transmit more
                // (or we stop here)
                p->iTransmitEmptyFunc(p->iCallbackWorkspace, 8);
                break;
            case 0x2:
                // We have received 1 or more bytes.  Please do
                // something with this received byte
                p->iReceivedByteFunc(
                    p->iCallbackWorkspace,
                    p->iInfo->iUART->u1.RBR);
                break;
            case 0x0:  //Modem interrupt
            case 0x3:  //Receive line status interrupt (RDA)
            case 0x6:  //Character time out indicator interrupt (CTI)
            default:
                // Ignore rest of states
                return;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART0
 *---------------------------------------------------------------------------*/
/**
 *  Capture the UART0 interrupt and forward to ISerialProcessInterrupt.
 *
 */
/*---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART0)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART0Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART1
 *---------------------------------------------------------------------------*/
/**
 *  Capture the UART1 interrupt and forward to ISerialProcessInterrupt.
 *
 */
/*---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART1)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART1Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART2
 *---------------------------------------------------------------------------*/
/**
 *  Capture the UART2 interrupt and forward to ISerialProcessInterrupt.
 *
 */
/*---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART2)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART3
 *---------------------------------------------------------------------------*/
/**
 *  Capture the UART3 interrupt and forward to ISerialProcessInterrupt.
 *
 */
/*---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART3)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART3Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialSendChar
 *---------------------------------------------------------------------------*/
/**
 *  Send a single character out the given serial port.
 *      NOTE:  Does not block even if output queue is full!
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @param [in]    aByte            byte to send
 *
 *  @return        T_uezError    	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_OutputByte(void *aWorkspace, TUInt8 aByte)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    p->iInfo->iUART->u1.THR = aByte;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialDisable
 *---------------------------------------------------------------------------*/
/**
 *  Disable serial processing on this port.
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError  	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_Deactivate(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    InterruptDisable(p->iInfo->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialEnable
 *---------------------------------------------------------------------------*/
/**
 *  Enable serial processing on this port.
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_Activate(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    InterruptEnable(p->iInfo->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_InitializeWorkspace_UART0
 *---------------------------------------------------------------------------*/
/**
 *  Initialize a serial port workspace for UART0
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError   	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_InitializeWorkspace_UART0(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    G_UART0Workspace = p;
    p->iInfo = &G_LPC1756_Serial_Info_UART0;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_InitializeWorkspace_UART1
 *---------------------------------------------------------------------------*/
/**
 *  Initialize a serial port workspace for UART1
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError    	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_InitializeWorkspace_UART1(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    G_UART1Workspace = p;
    p->iInfo = &G_LPC1756_Serial_Info_UART1;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_InitializeWorkspace_UART2
 *---------------------------------------------------------------------------*/
/**
 *  Initialize a serial port workspace for UART2
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_InitializeWorkspace_UART2(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    G_UART2Workspace = p;
    p->iInfo = &G_LPC1756_Serial_Info_UART2;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_InitializeWorkspace_UART3
 *---------------------------------------------------------------------------*/
/**
 *  Initialize a serial port workspace for UART3
 *
 *  @param [in]    *aWorkspace      Serial port workspace
 *
 *  @return        T_uezError    	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_InitializeWorkspace_UART3(void *aWorkspace)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    G_UART3Workspace = p;
    p->iInfo = &G_LPC1756_Serial_Info_UART3;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_Configure
 *---------------------------------------------------------------------------*/
/**
 *  Link the serial port to a pair of callback routines and an
 *      associated callback workspace.  The callbacks are called when
 *      a byte is received and when the transmit buffer becomes empty.
 *
 *  @param [in]    *aWorkspace          	Serial port workspace
 *
 *  @param [in]    *aCallbackWorkspace  	Callback's workspace
 *
 *  @param [in]    aReceivedByteCallback	Callback routine for received bytes
 *
 *  @param [in]    aTransmitEmptyCallback	Callback routine for transmit empty
 *
 *  @return        T_uezError              	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_Configure(
        void *aWorkspace,
        void *aCallbackWorkspace,
        HAL_Serial_Callback_Received_Byte aReceivedByteCallback,
        HAL_Serial_Callback_Transmit_Empty aTransmitEmptyCallback)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    const T_Serial_LPC1756_SerialInfo *p_info = p->iInfo;
    TUInt32 divider ;

