FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_Serial.c
    InterruptDisable(p->iInfo->iInterruptChannel);

    // Ensure power is on to the part
//    PCONP |= p->iPowerBit;

// Configure the PCLK divider here to be CCLK/1 on UART0, 1/
// TBD: UART3 and 4 should be CCLK/1!
SC->PCLKSEL0 = (SC->PCLKSEL0 & ~(3<<6)) | (1<<6);
SC->PCLKSEL0 = (SC->PCLKSEL0 & ~(3<<8)) | (1<<8);
SC->PCLKSEL1 = (SC->PCLKSEL1 & ~(3<<16)) | (1<<16);
SC->PCLKSEL1 = (SC->PCLKSEL1 & ~(3<<18)) | (1<<18);

    p->iReceivedByteFunc = aReceivedByteCallback;
    p->iTransmitEmptyFunc = aTransmitEmptyCallback;
    p->iCallbackWorkspace = aCallbackWorkspace;

    divider = BAUD_DIVIDER(SERIAL_PORTS_DEFAULT_BAUD);

    // Set the FIFO enable bit in the FCR register. This bit must be set for
    // proper UART operation.
    p_info->iUART->u3.FCR = 7; // FCRFE|RFR|TFR

    // Set baudrate
    p_info->iUART->LCR |= 0x80;
    p_info->iUART->u1.DLL = divider & 0x00ff;
    p_info->iUART->u2.DLM = (divider >> 8) & 0x00ff;
    p_info->iUART->LCR &= ~0x80;

    // Set default mode (8 bits, 1 stop bit, no parity)
    p_info->iUART->LCR = 0x03;

    //Enable UART0 interrupts
    p_info->iUART->u2.IER = 0x03; // Interrupts and TX and RX

    InterruptRegister(
        p_info->iInterruptChannel,
        p_info->iISR,
        p_info->iPriority,
        p->iHAL->iInterface.iName);

//TBD: For now, leave serial port deactivated
//    InterruptEnable(p_info->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_SetSerialSettings
 *---------------------------------------------------------------------------*/
/**
 *  Configure the serial port settings
 *
 *  @param [in]    *aWorkspace  	Serial port workspace
 *
 *  @param [in]    *aSettings 		Settings to use for serial port
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_SetSerialSettings(
        void *aWorkspace,
        T_Serial_Settings *aSettings)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    const T_Serial_LPC1756_SerialInfo *p_info = p->iInfo;
    TUInt32 divider ;

    // Record these settings
    p->iSettings = *aSettings;

    //TBD: Do the other settings!

    // Change the baud rate
    divider = BAUD_DIVIDER(aSettings->iBaud);
    p_info->iUART->LCR |= 0x80;
    p_info->iUART->u1.DLL = divider & 0x00ff;
    p_info->iUART->u2.DLM = (divider >> 8) & 0x00ff;
    p_info->iUART->LCR &= ~0x80;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_GetSerialSettings
 *---------------------------------------------------------------------------*/
/**
 *  Return the previously configured serial port
 *
 *  @param [in]    *aWorkspace   	Serial port workspace
 *
 *  @param [in]    *aSettings 		Settings used for serial port
 *
 *  @return        T_uezError   	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_GetSerialSettings(
        void *aWorkspace,
        T_Serial_Settings *aSettings)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;

    // Record these settings
    *aSettings = p->iSettings;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_SetHandshakingControl
 *---------------------------------------------------------------------------*/
/**
 *  Set the handshaking control for this serial port (if it has it)
 *
 *  @param [in]    *aWorkspace   	Serial port workspace
 *
 *  @param [in]    aControl			Control bits to use
 *
 *  @return        T_uezError   	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_SetHandshakingControl(
        void *aWorkspace,
        T_serialHandshakingControl aControl)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    const T_Serial_LPC1756_SerialInfo *p_info = p->iInfo;

    p_info->iUART->MCR = (aControl & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*/
/**
 *  Set the handshaking control for this serial port (if it has it)
 *
 *  @param [in]    *aWorkspace    	Serial port workspace
 *
 *  @param [in]    *aStatus 		Current status
 *
 *  @return        T_uezError    	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_Serial_GetHandshakingStatus(
        void *aWorkspace,
        T_serialHandshakingStatus *aStatus)
{
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;
    const T_Serial_LPC1756_SerialInfo *p_info = p->iInfo;

    *aStatus = (p_info->iUART->MSR & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Serial_GetStatus
 *---------------------------------------------------------------------------*/
/**
 *  Return the status of the port
 *
 *  @param [in]    *aWorkspace     		Serial port workspace
 *
 *  @return        T_serialStatusByte 	Status byte returned
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_serialStatusByte LPC1756_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_LPC1756_Workspace *p = (T_Serial_LPC1756_Workspace *)aWorkspace;

