FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_Serial.c
    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iUART->LSR & ((1<<6)|(1<<5))) {
        // not empty
    } else {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
/** List of serial port HAL interfaces */
const HAL_Serial G_LPC1756_Serial_UART0 = {
    {
    "Serial:LCP247x UART0",
    0x0100,
    LPC1756_Serial_InitializeWorkspace_UART0,
    sizeof(T_Serial_LPC1756_Workspace),
    },

    LPC1756_Serial_Configure,
    LPC1756_Serial_SetSerialSettings,
    LPC1756_Serial_GetSerialSettings,
    LPC1756_Serial_Activate,
    LPC1756_Serial_Deactivate,
    LPC1756_Serial_OutputByte,
    0,
    0,
    LPC1756_Serial_GetStatus,
};

const HAL_Serial G_LPC1756_Serial_UART1 = {
    {
    "Serial:LCP247x UART1",
    0x0100,
    LPC1756_Serial_InitializeWorkspace_UART1,
    sizeof(T_Serial_LPC1756_Workspace),
    },

    LPC1756_Serial_Configure,
    LPC1756_Serial_SetSerialSettings,
    LPC1756_Serial_GetSerialSettings,
    LPC1756_Serial_Activate,
    LPC1756_Serial_Deactivate,
    LPC1756_Serial_OutputByte,
    LPC1756_Serial_SetHandshakingControl,
    LPC1756_Serial_GetHandshakingStatus,
    LPC1756_Serial_GetStatus,
};

const HAL_Serial G_LPC1756_Serial_UART2 = {
    {
    "Serial:LCP247x UART2",
    0x0100,
    LPC1756_Serial_InitializeWorkspace_UART2,
    sizeof(T_Serial_LPC1756_Workspace),
    },

    LPC1756_Serial_Configure,
    LPC1756_Serial_SetSerialSettings,
    LPC1756_Serial_GetSerialSettings,
    LPC1756_Serial_Activate,
    LPC1756_Serial_Deactivate,
    LPC1756_Serial_OutputByte,
    0,
    0,
    LPC1756_Serial_GetStatus,
};

const HAL_Serial G_LPC1756_Serial_UART3 = {
    {
    "Serial:LCP247x UART3",
    0x0100,
    LPC1756_Serial_InitializeWorkspace_UART3,
    sizeof(T_Serial_LPC1756_Workspace),
    },

    LPC1756_Serial_Configure,
    LPC1756_Serial_SetSerialSettings,
    LPC1756_Serial_GetSerialSettings,
    LPC1756_Serial_Activate,
    LPC1756_Serial_Deactivate,
    LPC1756_Serial_OutputByte,
    0,
    0,
    LPC1756_Serial_GetStatus,
};

const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART0 = {
    UART0_IRQn,
    INTERRUPT_PRIORITY_HIGH,
    (UART1_TypeDef *)UART0_BASE,
    (TISRFPtr)ISerialUART0,
};

const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART1 = {
    UART1_IRQn,
    INTERRUPT_PRIORITY_HIGH,
    (UART1_TypeDef *)UART1_BASE,
    (TISRFPtr)ISerialUART1,
};

const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART2 = {
    UART2_IRQn,
    INTERRUPT_PRIORITY_HIGH,
    (UART1_TypeDef *)UART2_BASE,
    (TISRFPtr)ISerialUART2,
};

const T_Serial_LPC1756_SerialInfo G_LPC1756_Serial_Info_UART3 = {
    UART3_IRQn,
    INTERRUPT_PRIORITY_HIGH,
    (UART1_TypeDef *)UART3_BASE,
    (TISRFPtr)ISerialUART3,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1756_UART0_Require(
        T_uezGPIOPortPin aPinTXD0,
        T_uezGPIOPortPin aPinRXD0)
{
    static const T_LPC1756_IOCON_ConfigList txd0[] = {
            {GPIO_P0_2,   IOCON_D_DEFAULT(1)},
    };
    static const T_LPC1756_IOCON_ConfigList rxd0[] = {
            {GPIO_P0_3,   IOCON_D_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART0", (T_halInterface *)&G_LPC1756_Serial_UART0, 0,
            0);
    LPC1756_IOCON_ConfigPinOrNone(aPinTXD0, txd0, ARRAY_COUNT(txd0));
    LPC1756_IOCON_ConfigPinOrNone(aPinRXD0, rxd0, ARRAY_COUNT(rxd0));
}

void LPC1756_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC1756_IOCON_ConfigList txd1[] = {
            {GPIO_P0_15, IOCON_D_DEFAULT(1)},
            {GPIO_P2_0,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList rxd1[] = {
            {GPIO_P0_16, IOCON_D_DEFAULT(1)},
            {GPIO_P2_1,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList cts[] = {
            {GPIO_P0_17, IOCON_D_DEFAULT(1)},
            {GPIO_P2_2,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList dcd[] = {
            {GPIO_P0_18, IOCON_D_DEFAULT(1)},
            {GPIO_P2_3,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList dsr[] = {
            {GPIO_P2_4,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList dtr[] = {
            {GPIO_P2_5,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList ri[] = {
            {GPIO_P2_6,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList rts[] = {
            {GPIO_P0_22, IOCON_D_DEFAULT(1)},
            {GPIO_P2_7,  IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC1756_Serial_UART1, 0,
            0);
    LPC1756_IOCON_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC1756_IOCON_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC1756_IOCON_ConfigPinOrNone(aPinCTS, cts, ARRAY_COUNT(cts));
    LPC1756_IOCON_ConfigPinOrNone(aPinDCD, dcd, ARRAY_COUNT(dcd));
    LPC1756_IOCON_ConfigPinOrNone(aPinDSR, dsr, ARRAY_COUNT(dsr));
    LPC1756_IOCON_ConfigPinOrNone(aPinDTR, dtr, ARRAY_COUNT(dtr));
    LPC1756_IOCON_ConfigPinOrNone(aPinRI, ri, ARRAY_COUNT(ri));
    LPC1756_IOCON_ConfigPinOrNone(aPinRTS, rts, ARRAY_COUNT(rts));
}

void LPC1756_UART2_Require(
        T_uezGPIOPortPin aPinTXD2,
        T_uezGPIOPortPin aPinRXD2)
{
    static const T_LPC1756_IOCON_ConfigList txd2[] = {
            {GPIO_P0_10, IOCON_D_DEFAULT(1)},
            {GPIO_P2_8,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList rxd2[] = {
            {GPIO_P0_11, IOCON_D_DEFAULT(1)},
            {GPIO_P2_9,  IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART2", (T_halInterface *)&G_LPC1756_Serial_UART2, 0,
            0);
    LPC1756_IOCON_ConfigPinOrNone(aPinTXD2, txd2, ARRAY_COUNT(txd2));
    LPC1756_IOCON_ConfigPinOrNone(aPinRXD2, rxd2, ARRAY_COUNT(rxd2));
}

void LPC1756_UART3_Require(
        T_uezGPIOPortPin aPinTXD3,
        T_uezGPIOPortPin aPinRXD3)
{
    static const T_LPC1756_IOCON_ConfigList txd3[] = {
            {GPIO_P0_0,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_25, IOCON_A_DEFAULT(3)},
            {GPIO_P4_28, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1756_IOCON_ConfigList rxd3[] = {
            {GPIO_P0_1,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_26, IOCON_A_DEFAULT(3)},
            {GPIO_P4_29, IOCON_D_DEFAULT(2)},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART3", (T_halInterface *)&G_LPC1756_Serial_UART3, 0,
            0);
    LPC1756_IOCON_ConfigPinOrNone(aPinTXD3, txd3, ARRAY_COUNT(txd3));
    LPC1756_IOCON_ConfigPinOrNone(aPinRXD3, rxd3, ARRAY_COUNT(rxd3));
}
/** @} */
/*===========================================================================*
 * END OF FILE:  LPC1756_Serial.c
 *===========================================================================*/
